BOT_TOKEN = "7400814042:AAEN2QoYaNhQOsdWCS7OQPiGYNdGINZNZ7I"
DB_PATH = "data/db.db"
brawlers = [
    "Клэнси",
    "Берри",
    "Лили",
    "Драко",
    "Анджело",
    "Мелоди",
    "Ларри",
    "Лори",
    "Кит",
    "Мико",
    "Чарли",
    "Чак",
    "Перл",
    "Даг",
    "Корделиус",
    "Хэнк",
    "Мэйси",
    "Виллоу",
    "R-T",
    "Мэнди",
    "Грей",
    "Честер",
    "Бастер",
    "Гас",
    "Сэм",
    "Отис",
    "Бонни",
    "Джанет",
    "Ева",
    "Фэнг",
    "Лола",
    "Мэг",
    "Эш",
    "Грифф",
    "Базз",
    "Гром",
    "Скуик",
    "Белль",
    "Сту",
    "Гавс",
    "Эдгар",
    "Байрон",
    "Лу",
    "Амбер",
    "Колетт",
    "Вольт",
    "Спраут",
    "Нани",
    "Гэйл",
    "Джекки",
    "Макс",
    "Мистер П.",
    "Эмз",
    "Беа",
    "Сэнди",
    "8-Бит",
    "Биби",
    "Карл",
    "Роза",
    "Леон",
    "Тик",
    "Джин",
    "Фрэнк",
    "Пенни",
    "Дэррил",
    "Тара",
    "Пэм",
    "Пайпер",
    "Бо",
    "Поко",
    "Ворон",
    "Мортис",
    "Эль Примо",
    "Динамайк",
    "Нита",
    "Джесси",
    "Барли",
    "Спайк",
    "Рико",
    "Брок",
    "Булл",
    "Кольт",
    "Шелли"
]

brawlers_dict = {
    "Клэнси": "clancy",
    "Берри": "berry",
    "Лили": "lily",
    "Драко": "drake",
    "Анджело": "angelo",
    "Мелоди": "melody",
    "Ларри": "larry",
    "Лори": "lori",
    "Кит": "keith",
    "Мико": "miko",
    "Чарли": "charlie",
    "Чак": "chuck",
    "Перл": "pearl",
    "Даг": "doug",
    "Корделиус": "cordelius",
    "Хэнк": "hank",
    "Мэйси": "maize",
    "Виллоу": "willow",
    "R-T": "r_t",
    "Мэнди": "mandy",
    "Грей": "gray",
    "Честер": "chester",
    "Бастер": "buster",
    "Гас": "gus",
    "Сэм": "sam",
    "Отис": "otis",
    "Бонни": "bonnie",
    "Джанет": "janet",
    "Ева": "eve",
    "Фэнг": "fang",
    "Лола": "lola",
    "Мэг": "meg",
    "Эш": "ash",
    "Грифф": "griff",
    "Базз": "buzz",
    "Гром": "grom",
    "Скуик": "squeak",
    "Белль": "belle",
    "Сту": "stu",
    "Гавс": "gale",
    "Эдгар": "edgar",
    "Байрон": "byron",
    "Лу": "lou",
    "Амбер": "amber",
    "Колетт": "colette",
    "Вольт": "surge",
    "Спраут": "sprout",
    "Нани": "nani",
    "Гэйл": "gale",
    "Джекки": "jacky",
    "Макс": "max",
    "Мистер П.": "mr_p",
    "Эмз": "emz",
    "Беа": "bea",
    "Сэнди": "sandy",
    "8-Бит": "bit",
    "Биби": "bibi",
    "Карл": "carl",
    "Роза": "rosa",
    "Леон": "leon",
    "Тик": "tick",
    "Джин": "gene",
    "Фрэнк": "frank",
    "Пенни": "penny",
    "Дэррил": "darryl",
    "Тара": "tara",
    "Пэм": "pam",
    "Пайпер": "piper",
    "Бо": "bo",
    "Поко": "poco",
    "Ворон": "crow",
    "Мортис": "mortis",
    "Эль Примо": "el_primo",
    "Динамайк": "dynamike",
    "Нита": "nita",
    "Джесси": "jessie",
    "Барли": "barley",
    "Спайк": "spike",
    "Рико": "rico",
    "Брок": "brock",
    "Булл": "bull",
    "Кольт": "colt",
    "Шелли": "shelly"
}

countries = [
    "Австралия",
    "Австрия",
    "Азербайджан",
    "Албания",
    "Алжир",
    "Ангола",
    "Андорра",
    "Антигуа и Барбуда",
    "Аргентина",
    "Армения",
    "Афганистан",
    "Багамы",
    "Бангладеш",
    "Барбадос",
    "Бахрейн",
    "Белиз",
    "Белоруссия",
    "Бельгия",
    "Бенин",
    "Болгария",
    "Боливия",
    "Босния и Герцеговина",
    "Ботсвана",
    "Бразилия",
    "Бруней",
    "Буркина-Фасо",
    "Бурунди",
    "Бутан",
    "Вануату",
    "Ватикан",
    "Великобритания",
    "Венгрия",
    "Венесуэла",
    "Восточный Тимор",
    "Вьетнам",
    "Габон",
    "Гаити",
    "Гайана",
    "Гамбия",
    "Гана",
    "Гватемала",
    "Гвинея",
    "Гвинея-Бисау",
    "Германия",
    "Гондурас",
    "Гренада",
    "Греция",
    "Грузия",
    "Дания",
    "Джибути",
    "Доминика",
    "Доминиканская Республика",
    "Египет",
    "Замбия",
    "Зимбабве",
    "Израиль",
    "Индия",
    "Индонезия",
    "Иордания",
    "Ирак",
    "Иран",
    "Ирландия",
    "Исландия",
    "Испания",
    "Италия",
    "Йемен",
    "Кабо-Верде",
    "Казахстан",
    "Камбоджа",
    "Камерун",
    "Канада",
    "Катар",
    "Кения",
    "Кипр",
    "Киргизия",
    "Кирибати",
    "Китай",
    "Колумбия",
    "Коморы",
    "Конго",
    "КНДР",
    "Корея",
    "Коста-Рика",
    "Кот-д’Ивуар",
    "Куба",
    "Кувейт",
    "Лаос",
    "Латвия",
    "Лесото",
    "Либерия",
    "Ливан",
    "Ливия",
    "Литва",
    "Лихтенштейн",
    "Люксембург",
    "Маврикий",
    "Мавритания",
    "Мадагаскар",
    "Македония",
    "Малави",
    "Малайзия",
    "Мали",
    "Мальдивы",
    "Мальта",
    "Марокко",
    "Маршалловы Острова",
    "Мексика",
    "Микронезия",
    "Мозамбик",
    "Молдавия",
    "Монако",
    "Монголия",
    "Мьянма",
    "Намибия",
    "Науру",
    "Непал",
    "Нигер",
    "Нигерия",
    "Нидерланды",
    "Никарагуа",
    "Новая Зеландия",
    "Норвегия",
    "ОАЭ",
    "Оман",
    "Пакистан",
    "Палау",
    "Панама",
    "Папуа — Новая Гвинея",
    "Парагвай",
    "Перу",
    "Польша",
    "Португалия",
    "Россия",
    "Руанда",
    "Румыния",
    "Сальвадор",
    "Самоа",
    "Сан-Марино",
    "Сан-Томе и Принсипи",
    "Саудовская Аравия",
    "Свазиленд",
    "Северная Македония",
    "Сейшелы",
    "Сенегал",
    "Сент-Винсент и Гренадины",
    "Сент-Китс и Невис",
    "Сент-Люсия",
    "Сербия",
    "Сингапур",
    "Сирия",
    "Словакия",
    "Словения",
    "Соломоновы Острова",
    "Сомали",
    "Судан",
    "Суринам",
    "США",
    "Сьерра-Леоне",
    "Таджикистан",
    "Таиланд",
    "Танзания",
    "Того",
    "Тонга",
    "Тринидад и Тобаго",
    "Тувалу",
    "Тунис",
    "Туркмения",
    "Турция",
    "Уганда",
    "Узбекистан",
    "Украина",
    "Уругвай",
    "Фиджи",
    "Филиппины",
    "Финляндия",
    "Франция",
    "Хорватия",
    "ЦАР",
    "Чад",
    "Черногория",
    "Чехия",
    "Чили",
    "Швейцария",
    "Швеция",
    "Шри-Ланка",
    "Эквадор",
    "Экваториальная Гвинея",
    "Эритрея",
    "Эстония",
    "Эсватини",
    "Эфиопия",
    "ЮАР",
    "Южный Судан",
    "Ямайка",
    "Япония"
]
cis_country_codes = [
    "AM",  # Армения
    "AZ",  # Азербайджан
    "BY",  # Белоруссия
    "KZ",  # Казахстан
    "KG",  # Киргизия
    "MD",  # Молдавия
    "RU",  # Россия
    "TJ",  # Таджикистан
    "TM",  # Туркмения
    "UZ",  # Узбекистан
    "UA"   # Украина
]
country_codes = [
    "AU",  # Австралия
    "AT",  # Австрия
    "AZ",  # Азербайджан
    "AL",  # Албания
    "DZ",  # Алжир
    "AO",  # Ангола
    "AD",  # Андорра
    "AG",  # Антигуа и Барбуда
    "AR",  # Аргентина
    "AM",  # Армения
    "AF",  # Афганистан
    "BS",  # Багамы
    "BD",  # Бангладеш
    "BB",  # Барбадос
    "BH",  # Бахрейн
    "BZ",  # Белиз
    "BY",  # Белоруссия
    "BE",  # Бельгия
    "BJ",  # Бенин
    "BG",  # Болгария
    "BO",  # Боливия
    "BA",  # Босния и Герцеговина
    "BW",  # Ботсвана
    "BR",  # Бразилия
    "BN",  # Бруней
    "BF",  # Буркина-Фасо
    "BI",  # Бурунди
    "BT",  # Бутан
    "VU",  # Вануату
    "VA",  # Ватикан
    "GB",  # Великобритания
    "HU",  # Венгрия
    "VE",  # Венесуэла
    "TL",  # Восточный Тимор
    "VN",  # Вьетнам
    "GA",  # Габон
    "HT",  # Гаити
    "GY",  # Гайана
    "GM",  # Гамбия
    "GH",  # Гана
    "GT",  # Гватемала
    "GN",  # Гвинея
    "GW",  # Гвинея-Бисау
    "DE",  # Германия
    "HN",  # Гондурас
    "GD",  # Гренада
    "GR",  # Греция
    "GE",  # Грузия
    "DK",  # Дания
    "DJ",  # Джибути
    "DM",  # Доминика
    "DO",  # Доминиканская Республика
    "EG",  # Египет
    "ZM",  # Замбия
    "ZW",  # Зимбабве
    "IL",  # Израиль
    "IN",  # Индия
    "ID",  # Индонезия
    "JO",  # Иордания
    "IQ",  # Ирак
    "IR",  # Иран
    "IE",  # Ирландия
    "IS",  # Исландия
    "ES",  # Испания
    "IT",  # Италия
    "YE",  # Йемен
    "CV",  # Кабо-Верде
    "KZ",  # Казахстан
    "KH",  # Камбоджа
    "CM",  # Камерун
    "CA",  # Канада
    "QA",  # Катар
    "KE",  # Кения
    "CY",  # Кипр
    "KG",  # Киргизия
    "KI",  # Кирибати
    "CN",  # Китай
    "CO",  # Колумбия
    "KM",  # Коморы
    "CG",  # Конго
    "KP",  # КНДР
    "KR",  # Корея
    "CR",  # Коста-Рика
    "CI",  # Кот-д’Ивуар
    "CU",  # Куба
    "KW",  # Кувейт
    "LA",  # Лаос
    "LV",  # Латвия
    "LS",  # Лесото
    "LR",  # Либерия
    "LB",  # Ливан
    "LY",  # Ливия
    "LT",  # Литва
    "LI",  # Лихтенштейн
    "LU",  # Люксембург
    "MU",  # Маврикий
    "MR",  # Мавритания
    "MG",  # Мадагаскар
    "MK",  # Македония
    "MW",  # Малави
    "MY",  # Малайзия
    "ML",  # Мали
    "MV",  # Мальдивы
    "MT",  # Мальта
    "MA",  # Марокко
    "MH",  # Маршалловы Острова
    "MX",  # Мексика
    "FM",  # Микронезия
    "MZ",  # Мозамбик
    "MD",  # Молдавия
    "MC",  # Монако
    "MN",  # Монголия
    "MM",  # Мьянма
    "NA",  # Намибия
    "NR",  # Науру
    "NP",  # Непал
    "NE",  # Нигер
    "NG",  # Нигерия
    "NL",  # Нидерланды
    "NI",  # Никарагуа
    "NZ",  # Новая Зеландия
    "NO",  # Норвегия
    "AE",  # ОАЭ
    "OM",  # Оман
    "PK",  # Пакистан
    "PW",  # Палау
    "PA",  # Панама
    "PG",  # Папуа — Новая Гвинея
    "PY",  # Парагвай
    "PE",  # Перу
    "PL",  # Польша
    "PT",  # Португалия
    "RU",  # Россия
    "RW",  # Руанда
    "RO",  # Румыния
    "SV",  # Сальвадор
    "WS",  # Самоа
    "SM",  # Сан-Марино
    "ST",  # Сан-Томе и Принсипи
    "SA",  # Саудовская Аравия
    "SZ",  # Свазиленд
    "MK",  # Северная Македония
    "SC",  # Сейшелы
    "SN",  # Сенегал
    "VC",  # Сент-Винсент и Гренадины
    "KN",  # Сент-Китс и Невис
    "LC",  # Сент-Люсия
    "RS",  # Сербия
    "SG",  # Сингапур
    "SY",  # Сирия
    "SK",  # Словакия
    "SI",  # Словения
    "SB",  # Соломоновы Острова
    "SO",  # Сомали
    "SD",  # Судан
    "SR",  # Суринам
    "US",  # США
    "SL",  # Сьерра-Леоне
    "TJ",  # Таджикистан
    "TH",  # Таиланд
    "TZ",  # Танзания
    "TG",  # Того
    "TO",  # Тонга
    "TT",  # Тринидад и Тобаго
    "TV",  # Тувалу
    "TN",  # Тунис
    "TM",  # Туркмения
    "TR",  # Турция
    "UG",  # Уганда
    "UZ",  # Узбекистан
    "UA",  # Украина
    "UY",  # Уругвай
    "FJ",  # Фиджи
    "PH",  # Филиппины
    "FI",  # Финляндия
    "FR",  # Франция
    "HR",  # Хорватия
    "CF",  # ЦАР
    "TD",  # Чад
    "ME",  # Черногория
    "CZ",  # Чехия
    "CL",  # Чили
    "CH",  # Швейцария
    "SE",  # Швеция
    "LK",  # Шри-Ланка
    "EC",  # Эквадор
    "GQ",  # Экваториальная Гвинея
    "ER",  # Эритрея
    "EE",  # Эстония
    "SZ",  # Эсватини
    "ET",  # Эфиопия
    "ZA",  # ЮАР
    "SS",  # Южный Судан
    "JM",  # Ямайка
    "JP"   # Япония
]
